In [1]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

In [9]:
#Series由一组数据以及一组与之相关的数据标签（即索引）组成
obj=Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [10]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [11]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
obj2=Series([4,7,-5,3],index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2[obj2>0]
obj2*2
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [10]:
#如果数据放在字典中，可以直接通过字典来创建Series
sdata={'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}
obj3=Series(sdata)
obj3
#pandas中isnull和notnull可用于检测缺失数据

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [24]:
#Dataframe，一组有序的列，每列可以是不同的值类型
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
     'year':[2000,2001,2002,2001,2002],
      'pop':[1.5,1.7,3.6,2.4,2.9]
     }
frame=DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [26]:
DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [27]:
frame2=DataFrame(data,columns=['year','state','pop','debt'],
                index=['one','two','three','four','five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [28]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [30]:
#通过类似字典标记的方式，可以将DataFrame的列获取为一个Series
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [31]:
#用索引字段ix对位置或名称的方式进行索取
frame2.ix['three']

C:\Users\lichen\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [33]:
val=Series([-1.2,-1.5,-1.7],index=['two','four','five'])
frame2['debt']=val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [34]:
#为不存在的列赋值会创建出一个新列
frame2['eastern']=frame2.state=='Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [35]:
del frame2['eastern']
#通过索引方式返回的列是相应数据的视图，并不是副本。

In [36]:
#嵌套字典，外层字典的键作为列，内层键作为行索引
pop={'Nevada':{2001:2.4,2002:2.9},
    'Ohio':{2000:1.5,2001:1.7,2002:3.6}}
frame3=DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [37]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [38]:
#由Series组成的字典也是一样的用法
pdata={'Ohio':frame3['Ohio'][:-1],
      'Nevada':frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [39]:
frame3.index.name='year';
frame3.columns.name='state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [41]:
#h和Series一样，values属性会以二维ndarray的形式返回DataFrame中的数据
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [43]:
#索引对象
obj=Series(range(3),index=['a','b','c'])
index=obj.index
index
#index对象是不可修改的

Index(['a', 'b', 'c'], dtype='object')

In [46]:
#Index的功能类似一个固定大小的集合
frame3
'Ohio'in frame3.columns

True

In [47]:
obj=Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [49]:
obj2=obj.reindex(['a','b','c','d','e'],fill_value=0)
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [50]:
#ffill实现前向值填充
obj3=Series(['blue','purple','yellow'],index=[0,2,4])
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [53]:
frame=DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],
                columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [55]:
frame2=frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [56]:
states=['Texas','Utah','California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [61]:
#丢弃制定轴上的项
obj=Series(np.arange(5.),index=['a','b','c','d','e'])
new_obj=obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [62]:
#索引、选取和过滤
obj=Series(np.arange(4.),index=['a','b','c','d'])
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [63]:
#利用标签的切片运算与普通的python切片运算不同，其末端是包含的
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [65]:
data=DataFrame(np.arange(16).reshape((4,4)),
              index=['Ohio','Colorado','Utah','New York'],
              columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [66]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [67]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [68]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [70]:
data[data<5]=0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [73]:
data
data.ix['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [75]:
#算数运算和数据对齐
df1=DataFrame(np.arange(9.).reshape((3,3)),columns=list('bcd'),index=['Ohio','Texas','Colorado'])
df2=DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [76]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [77]:
df1+df2#并集

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [78]:
df1=DataFrame(np.arange(12.).reshape((3,4)),columns=list('abcd'))
df2=DataFrame(np.arange(20.).reshape((4,5)),columns=list('abcde'))
df1
df2
df1+df2

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [79]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [80]:
df1.reindex(columns=df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [82]:
#DataFrame和Series之间的运算
frame=DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])
series=frame.ix[0]
frame
series

C:\Users\lichen\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [84]:
#会将Series的索引匹配到DataFrame的列。
#如果找不到索引，会重新索引形成并集
series2=Series(range(3),index=['b','e','f'])
series2
frame+series2

b    0
e    1
f    2
dtype: int32

In [86]:
series3=frame['d']
frame.sub(series3,axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [14]:
#函数的应用和映射
frame=DataFrame(np.random.randn(4,3),columns=list('bde'),
               index=['Utah','Ohio','Texas','Oregon'])
frame
np.abs(frame)

               b         d         e
Utah    1.445622  0.343333  1.489772
Ohio    0.211519  0.550867  0.169260
Texas   0.032699  1.344950  0.138521
Oregon  0.372185  0.283967  2.468463

In [15]:
f=lambda x:x.max()-x.min()
frame.apply(f)

b    1.817807
d    1.060983
e    2.606985
dtype: float64

In [16]:
def f(x):
    return Series([x.min(),x.max()],index=['min','max'])
frame.apply(f)

            b         d         e
min -1.445622 -1.344950 -0.138521
max  0.372185 -0.283967  2.468463

In [17]:
#得到frame中各个浮点值的格式化字符串
format=lambda x:'%.2f'% x
frame.applymap(format)

            b      d      e
Utah    -1.45  -0.34   1.49
Ohio    -0.21  -0.55   0.17
Texas   -0.03  -1.34  -0.14
Oregon   0.37  -0.28   2.47

In [18]:
#排序和排名
obj=Series(range(4),index=['d','a','b','c'])
obj.sort_index()
#对索引进行排序

a    1
b    2
c    3
d    0
dtype: int32

In [23]:
frame=DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],
               columns=['d','a','b','c'])
frame.sort_index()
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [24]:
#降序排序
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [26]:
#若要按值对Series进行排序，可使用order方法,已不适用
obj=Series([4,7,-3,2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [29]:
frame=DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
frame
frame.sort_index(by='b')

C:\Users\lichen\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  This is separate from the ipykernel package so we can avoid doing imports until

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [30]:
obj=Series([7,-5,7,4,2,0,4])
obj.rank()
#如果有相同的值，则为各组分配一个平均排名

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [31]:
#在原数据中出现的顺序
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [32]:
frame=DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [33]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [34]:
#带有重复值 的轴索引
obj=Series(range(5),index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [35]:
#判断是否是唯一的
obj.index.is_unique
#带有重复值的索引，返回一个Series

False

In [36]:
#对DataFrame的行进行索引
df=DataFrame(np.random.randn(4,3),index=['a','a','b','b'])
df

          0         1         2
a -0.084561  0.220535  0.154547
a  0.085398  0.209555 -0.774622
b  0.880465  1.340720  1.824008
b  0.319317  0.910949  1.096442

In [37]:
df.ix['b']

C:\Users\lichen\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          0         1         2
b  0.880465  1.340720  1.824008
b  0.319317  0.910949  1.096442

In [40]:
#汇总和计算描述统计
df=DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=['one','two'])
df
df.sum()#返回一个含有列小计的Series

one    9.25
two   -5.80
dtype: float64

In [41]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [42]:
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [44]:
#间接统计，返回的是索引
df.idxmax()

one    b
two    d
dtype: object

In [45]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [46]:
#一次性产生多个汇总统计
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [47]:
#相关系数与协方差
import pandas.io.data as web

ImportError: The pandas.io.data module is moved to a separate package (pandas-datareader). After installing the pandas-datareader package (https://github.com/pydata/pandas-datareader), you can change the import ``from pandas.io import data, wb`` to ``from pandas_datareader import data, wb``.

In [49]:
obj=Series(['c','a','d','a','a','b','b','c','c'])
uniques=obj.unique()
uniques
#可以用uniques.sort()进行排序
#obj.value_counts()计算一个Series钟各值出现的频率

array(['c', 'a', 'd', 'b'], dtype=object)

In [51]:
#处理缺失数据
string_data=Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [52]:
string_data.isnull()
#注意null值会被当作NA处理

0    False
1    False
2     True
3    False
dtype: bool

In [53]:
#滤除缺失数据
from numpy import nan as NA
data=Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [ ]:
#对于DataFrame，dropna默认丢弃任何含有缺失值的行
#传入how=all将只丢弃全为NA的那些行，若丢弃列，传入axis=1

In [55]:
#填充缺失数据
df
df.fillna(0)

    one  two
a  1.40  0.0
b  7.10 -4.5
c  0.00  0.0
d  0.75 -1.3

In [64]:
#若是通过一个字典调用fillna,可以实现对不同的列填充不同的值
df=DataFrame(np.random.randn(7,3))
df.ix[:4,1]=NA

C:\Users\lichen\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

In [61]:
df.fillna({1:0.5,3:-1})

          0         1         2
0  0.746375  0.370958  0.995724
1  1.694692 -0.596890  0.844014
2 -0.090234  0.271306  1.339267
3 -0.221452 -1.007913  0.877554
4  0.224565  0.471117  0.910195
5  0.927716  0.362423 -1.741680
6  0.108787  0.976050  0.297501

In [65]:
#对reindex有效的那些插值方法也可用于fillna
df=DataFrame(np.random.randn(6,3))
df.ix[2:,1]=NA

C:\Users\lichen\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

In [67]:
#层次化索引,在一个轴上拥有多个索引级别
data=Series(np.random.randn(10),index=[['a','a','a','b','b','b','c','c','d','d'],[1,2,3,1,2,3,1,2,2,3]])
data

a  1   -0.249995
   2    1.330084
   3    0.574832
b  1    1.076645
   2    1.852554
   3   -2.007058
c  1   -0.393815
   2   -0.700710
d  2    1.757752
   3    3.056191
dtype: float64

In [68]:
#ix已弃用
data.ix[['b','d']]

C:\Users\lichen\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b  1    1.076645
   2    1.852554
   3   -2.007058
d  2    1.757752
   3    3.056191
dtype: float64

In [71]:
data.loc[['b','d']]

b  1    1.076645
   2    1.852554
   3   -2.007058
d  2    1.757752
   3    3.056191
dtype: float64

In [72]:
#层次化索引在数据重塑和基于分组的操作（如透视表生成）中很重要
data.unstack()

          1         2         3
a -0.249995  1.330084  0.574832
b  1.076645  1.852554 -2.007058
c -0.393815 -0.700710       NaN
d       NaN  1.757752  3.056191

In [73]:
data.unstack().stack()

a  1   -0.249995
   2    1.330084
   3    0.574832
b  1    1.076645
   2    1.852554
   3   -2.007058
c  1   -0.393815
   2   -0.700710
d  2    1.757752
   3    3.056191
dtype: float64

In [74]:
frame=DataFrame(np.arange(12).reshape((4,3)),index=[['a','a','b','b'],[1,2,1,2]],columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [75]:
#分清索引名称跟轴标签
frame.index.names=['key1','key2']
frame.columns.names=['state','color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [76]:
#重排分级顺序
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [77]:
frame.sortlevel(1)

C:\Users\lichen\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [78]:
#根据级别汇总统计
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [79]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [81]:
#使用DataFrame的列
frame=DataFrame({'a':range(7),'b':range(7,0,-1),'c':['one','one','one','two','two','two','two'],'d':[0,1,2,0,1,2,3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [83]:
#将一个或多个列转换为行索引
frame2=frame.set_index(['c','d'])
frame2
#drop=False可将那些列保留下来

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1